In [4]:
import numpy as np
import pandas as pd

In [5]:
# Project, gender prediction

In [6]:
!pip install Faker

Requirement already satisfied: Faker in d:\dev\venv\lib\site-packages (19.13.0)
Requirement already satisfied: python-dateutil>=2.4 in d:\dev\venv\lib\site-packages (from Faker) (2.8.2)
Requirement already satisfied: six>=1.5 in d:\dev\venv\lib\site-packages (from python-dateutil>=2.4->Faker) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
!pip install names-dataset

Requirement already satisfied: names-dataset in d:\dev\venv\lib\site-packages (3.1.0)
Requirement already satisfied: pycountry in d:\dev\venv\lib\site-packages (from names-dataset) (22.3.5)
Requirement already satisfied: setuptools in d:\dev\venv\lib\site-packages (from pycountry->names-dataset) (68.2.2)

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [8]:
# EDA -> Explorary Data Analysis

In [9]:
from faker import Faker
en_faker = Faker()
fa_faker = Faker('Fa')

In [10]:
from names_dataset import NameDataset

In [11]:
nd = NameDataset()

In [12]:
nd.search('Amir')

{'first_name': {'country': {'United Arab Emirates': 0.06,
   'Algeria': 0.096,
   'Egypt': 0.176,
   'Israel': 0.035,
   'Iran, Islamic Republic of': 0.168,
   'Morocco': 0.085,
   'Malaysia': 0.093,
   'Oman': 0.035,
   'Saudi Arabia': 0.182,
   'Tunisia': 0.07},
  'gender': {'Female': 0.031, 'Male': 0.969},
  'rank': {'United Arab Emirates': 27,
   'Algeria': 61,
   'Egypt': 187,
   'Israel': 32,
   'Iran, Islamic Republic of': 7,
   'Morocco': 167,
   'Malaysia': 23,
   'Oman': 33,
   'Saudi Arabia': 63,
   'Tunisia': 62}},
 'last_name': {'country': {'United Arab Emirates': 0.052,
   'Algeria': 0.123,
   'Egypt': 0.197,
   'Israel': 0.024,
   'Iraq': 0.027,
   'Morocco': 0.184,
   'Malaysia': 0.159,
   'Oman': 0.036,
   'Saudi Arabia': 0.153,
   'Tunisia': 0.045},
  'gender': {},
  'rank': {'United Arab Emirates': 164,
   'Algeria': 66,
   'Egypt': 466,
   'Israel': 120,
   'Iraq': 1129,
   'Morocco': 86,
   'Malaysia': 93,
   'Oman': 213,
   'Saudi Arabia': 238,
   'Tunisia': 253}}}

In [13]:
df = pd.DataFrame(
    {
        'names': [en_faker.name() for i in range(100)]
    }
)
df

                names
0       Randy Schultz
1        Tyler Martin
2   Jennifer Crawford
3         Erin Harris
4   Russell Dominguez
..                ...
95         John Watts
96       Mark Woodard
97      Patrick Ramos
98    Megan Alexander
99    Melinda Johnson

[100 rows x 1 columns]

# Comment
## Sub-Comment
normal text

In [14]:
df['first name'] = df['names'].apply(lambda name: name.split()[0])

In [15]:
df['last name'] = df['names'].apply(lambda name: name.split()[-1])

In [16]:
df

                names first name  last name
0       Randy Schultz      Randy    Schultz
1        Tyler Martin      Tyler     Martin
2   Jennifer Crawford   Jennifer   Crawford
3         Erin Harris       Erin     Harris
4   Russell Dominguez    Russell  Dominguez
..                ...        ...        ...
95         John Watts       John      Watts
96       Mark Woodard       Mark    Woodard
97      Patrick Ramos    Patrick      Ramos
98    Megan Alexander      Megan  Alexander
99    Melinda Johnson    Melinda    Johnson

[100 rows x 3 columns]

In [17]:
df['names'].str.split()

0         [Randy, Schultz]
1          [Tyler, Martin]
2     [Jennifer, Crawford]
3           [Erin, Harris]
4     [Russell, Dominguez]
              ...
95           [John, Watts]
96         [Mark, Woodard]
97        [Patrick, Ramos]
98      [Megan, Alexander]
99      [Melinda, Johnson]
Name: names, Length: 100, dtype: object

In [18]:
name = 'Amire'
amire_gender = nd.search(name)['first_name']['gender']
amire_gender

{'Female': 0.502, 'Male': 0.498}

In [19]:
max([1,2,3])

3

In [20]:
max([1,2,3], key=lambda x: -x)

1

In [21]:
max(amire_gender, key=amire_gender.get)

'Female'

In [22]:
for p in amire_gender:
    print(p)

Female
Male

In [25]:
max(amire_gender) # 'M' > 'F'

'Male'

In [26]:
max(amire_gender, key=amire_gender.get)

'Female'

In [28]:
list(filter(lambda x: x>5, [1,2,3,4,5,6,7,8,9,90]))

[6, 7, 8, 9, 90]

In [29]:
df

                names first name  last name
0       Randy Schultz      Randy    Schultz
1        Tyler Martin      Tyler     Martin
2   Jennifer Crawford   Jennifer   Crawford
3         Erin Harris       Erin     Harris
4   Russell Dominguez    Russell  Dominguez
..                ...        ...        ...
95         John Watts       John      Watts
96       Mark Woodard       Mark    Woodard
97      Patrick Ramos    Patrick      Ramos
98    Megan Alexander      Megan  Alexander
99    Melinda Johnson    Melinda    Johnson

[100 rows x 3 columns]

In [30]:
df['v'] = np.random.randint(0, 100, 100)

In [31]:
df

                names first name  last name   v
0       Randy Schultz      Randy    Schultz  45
1        Tyler Martin      Tyler     Martin   7
2   Jennifer Crawford   Jennifer   Crawford  14
3         Erin Harris       Erin     Harris  35
4   Russell Dominguez    Russell  Dominguez   9
..                ...        ...        ...  ..
95         John Watts       John      Watts  14
96       Mark Woodard       Mark    Woodard  39
97      Patrick Ramos    Patrick      Ramos   1
98    Megan Alexander      Megan  Alexander  12
99    Melinda Johnson    Melinda    Johnson   4

[100 rows x 4 columns]

In [35]:
df['v'].values

array([45,  7, 14, 35,  9, 15, 54, 22, 20, 38, 44, 19, 65,  4, 44, 36, 93,
       27, 19, 81, 49, 84, 11,  5, 44, 50, 84, 11, 63, 17, 98, 21, 94, 11,
       14, 21, 49, 20, 44,  5, 11, 81, 77, 47, 78, 56, 82, 77,  0, 60, 18,
       16, 72, 12, 13, 95, 94, 61, 88,  7, 73, 74, 62, 21, 87, 85, 86, 72,
       36, 10,  1, 64, 10, 25,  1, 26, 58, 93, 83, 38, 92, 75, 75, 41, 58,
        6, 72, 84, 69, 43, 23, 92, 95, 90, 93, 14, 39,  1, 12,  4])

In [37]:
df['v'].value_counts() # without null values

v
11    4
44    4
93    3
72    3
21    3
     ..
60    1
18    1
16    1
13    1
39    1
Name: count, Length: 65, dtype: int64

In [38]:
df.v.isna()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: v, Length: 100, dtype: bool

In [39]:
df['v'].isna() # isNotANumber

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: v, Length: 100, dtype: bool

In [40]:
df.v.isna().sum()

0

In [41]:
df.v.info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: v
Non-Null Count  Dtype
--------------  -----
100 non-null    int32
dtypes: int32(1)
memory usage: 528.0 bytes

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       100 non-null    object
 1   first name  100 non-null    object
 2   last name   100 non-null    object
 3   v           100 non-null    int32
dtypes: int32(1), object(3)
memory usage: 2.9+ KB